routes/web.php

Route::post('/comments', [CommentController::class, 'store'])->name('comments.store');

use App\Models\User; // Import the User model
Route::middleware(['auth:sanctum', 'verified'])->get('/dashboard', function () {
    $user = User::find(1);

    if ($user) {
        $user->assignRole('admin');
    }

    return view('dashboard');
})->name('dashboard');
---
SELECT * FROM `users` WHERE `users`.`id` = 1 LIMIT 1