app/Http/Controllers/Frontend/ListingController.php

    public function welcome()
    {
        $categories = Category::all();
        $featured_ads = Listing::where('is_published', true)->get();
---
SELECT * FROM `categories`
SELECT * FROM `listings` WHERE `is_published` = 1