app/Http/Controllers/FeedbackController.php

    public function index()
    {
        // Retrieve all feedbacks from the database
        $feedbacks = Feedback::all();
---
SELECT * FROM `feedback`