app/Http/Controllers/ListingController.php

SELECT * FROM `listings` WHERE `user_id` = 1
---
    public function index()
    {
        $listings = Listing::where('user_id', auth()->user()->id)->get();

INSERT INTO `listings` (`user_id`, `category_id`, `sub_category_id`, `child_category_id`, `title`, `slug`, `description`, `price`, `price_negotiable`, `location`, `condition`, `phone_number`, `is_published`, `country_id`, `city_id`, `state_id`, `featured_image`, `updated_at`, `created_at`) VALUES (1, '8', '3', '3', 'Brand New iPhone 13 Pro Max - 256GB - Midnight Blue', 'brand-new-iphone-13-pro-max-256gb-midnight-blue', 'Selling a brand new iPhone 13 Pro Max with 256GB storage in Midnight Blue color. This latest model FROM Apple comes with all the advanced features you need, including a stunning Super Retina XDR display, powerful A15 Bionic chip, pro camera system with advanced low-light performance, and all-day battery life. Whether you\'re upgrading or looking for a high-end smartphone, this iPhone 13 Pro Max IS the perfect choice!', '89000', 'fixed', 'Dhaka', 'new', '019694209696', '1', '1', '1', '2', 'public/listings/KEKgfbWT6yZW6TyJCP7Mn64y8LLhBQMFLWkVxSqv.jpg', '2024-04-20 17:42:48', '2024-04-20 17:42:48')
---
    public function store(StoreListingRequest $request)
    {
        $featured_image = $request->file('featured_image')->store('public/listings');

        Listing::create([
            'user_id' => auth()->user()->id,
            'category_id' => $request->category_id,
            'sub_category_id' => $request->sub_category_id,
            'child_category_id' => $request->child_category_id,
            'title' => $request->title,
            'slug' => Str::slug($request->title),
            'description' => $request->description,
            'price' => $request->price,
            'price_negotiable' => $request->price_negotiable,
            'location' => $request->location,
            'condition' => $request->condition,
            'phone_number' => $request->phone_number,
            'is_published' => $request->is_published,
            'country_id' => $request->country_id,
            'city_id' => $request->city_id,
            'state_id' => $request->state_id,
            'featured_image' => $featured_image
        ]);

SELECT * FROM `listings` WHERE `listings`.`id` = '2' LIMIT 1
---
    public function edit($id)
    {
        $listing = Listing::find($id);

SELECT * FROM `listings` WHERE `listings`.`id` = '2' LIMIT 1
SELECT * FROM `users` WHERE `users`.`id` in (1)
SELECT * FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
        public function post_details($id)
        {
            $listing = Listing::with('user')->findOrFail($id);
            $user = User::find($listing->user_id);