app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $categories = Category::paginate(2);
---
SELECT * FROM `categories` LIMIT 2 offset 0
SELECT count(*) as aggregate FROM `categories`

    public function store(StoreCategoryRequest $request)
    {
        if ($request->hasFile('image')) {
            $path = $request->file('image')->store('public/categories');

            Category::create([
                'name' => $request->name,
                'slug' => Str::slug($request->name),
                'image' => $path
            ]);
---
INSERT INTO `categories` (`name`, `slug`, `image`, `updated_at`, `created_at`) VALUES ('Community', 'community', 'public/categories/HTvAEXbsANFSHiNtJBAwDZxdtq6jN2eAtrKJyFio.png', '2024-04-20 16:29:37', '2024-04-20 16:29:37')

    public function add_sub_store(Request $request, Category $category)
    {
        if ($request->hasFile('image')) {
            $path = $request->file('image')->store('public/subcategories');

            $category->sub_categories()->create([
                'name' => $request->name,
                'slug' => Str::slug($request->name),
                'category_id' => $category->id,
                'image' => $path
            ]);
---
INSERT INTO `sub_categories` (`name`, `slug`, `category_id`, `image`, `updated_at`, `created_at`) VALUES ('Community', 'community', 8, 'public/subcategories/Km9tRSpm9Yyo000IL4WZuhJQcOlrvqFLeWDijoe6.png', '2024-04-20 15:54:15', '2024-04-20 15:54:15')