app/Http/Controllers/Admin/ListingController.php

SELECT * FROM `listings`
---
    public function index()
    {
        $listings = Listing::all();